# HigherEnd Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..HigherEnd Property
RebarShape Class See Also
---
Defines the higher end of rebar shape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public int HigherEnd { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HigherEnd As Integer
	Get
```

Visual C++
---
```text
public:
property int HigherEnd {
	int get ();
}
```

# Remarks
Change this property will make rebar shape's start and end hooks swap.
# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace